# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

brew 'git'
brew 'zsh'
brew 'openssl'
brew 'coreutils'
brew 'fzf'
brew 'tmux'
brew 'ripgrep'
brew 'wget'
brew 'curl'
brew 'gh'
brew 'bash'
brew 'neovim'
brew 'imagemagick'
brew 'koekeishiya/formulae/skhd'
brew 'koekeishiya/formulae/yabai'
brew 'fish'
brew 'starship'
brew 'eza'
brew 'midnight-commander'
brew 'ollama'

cask 'raycast'
cask 'zoom'
cask 'vlc'
cask 'visual-studio-code'
cask 'discord'
cask 'github'
cask 'arc'
cask 'warp'
cask 'slack'

# terminal emulators
cask 'kitty'

# fonts
cask 'font-meslo-lg-nerd-font'
